[net]
batch=128
subdivisions=1
<<<<<<< HEAD
height=227
width=227
channels=3
momentum=0.9
decay=0.0005
max_crop=256

learning_rate=0.01
policy=poly
power=4
max_batches=800000

angle=7
hue = .1
saturation=.75
exposure=.75
aspect=.75

[convolutional]
filters=96
size=11
stride=4
pad=0
activation=relu
=======
height=256
width=256
channels=3
learning_rate=0.01
momentum=0.9
decay=0.0005

[crop]
crop_height=224
crop_width=224
flip=1
angle=0
saturation=1
exposure=1

[convolutional]
filters=64
size=11
stride=4
pad=0
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[maxpool]
size=3
stride=2
<<<<<<< HEAD
padding=0

[convolutional]
filters=256
size=5
stride=1
pad=1
activation=relu
=======

[convolutional]
filters=192
size=5
stride=1
pad=1
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[maxpool]
size=3
stride=2
<<<<<<< HEAD
padding=0
=======
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[convolutional]
filters=384
size=3
stride=1
pad=1
<<<<<<< HEAD
activation=relu

[convolutional]
filters=384
size=3
stride=1
pad=1
activation=relu
=======
activation=ramp

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[convolutional]
filters=256
size=3
stride=1
pad=1
<<<<<<< HEAD
activation=relu
=======
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[maxpool]
size=3
stride=2
<<<<<<< HEAD
padding=0

[connected]
output=4096
activation=relu
=======

[connected]
output=4096
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[dropout]
probability=.5

[connected]
output=4096
<<<<<<< HEAD
activation=relu
=======
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[dropout]
probability=.5

[connected]
output=1000
<<<<<<< HEAD
activation=linear
=======
activation=ramp
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445

[softmax]
groups=1

[cost]
type=sse

