[net]
batch=128
<<<<<<< HEAD
<<<<<<< HEAD
subdivisions=1
height=224
width=224
channels=3
momentum=0.9
decay=0.0005
max_crop=320

learning_rate=0.1
policy=poly
power=4
max_batches=1600000

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
subdivisions=32
height=256
width=256
channels=3
learning_rate=0.01
momentum=0.9
decay=0.0005

[crop]
crop_height=224
crop_width=224
flip=1
angle=0
saturation=1
exposure=1

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
<<<<<<< HEAD
<<<<<<< HEAD
size=2
stride=2

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
stride=2
size=2

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
<<<<<<< HEAD
<<<<<<< HEAD
size=2
stride=2

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
stride=2
size=2

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
<<<<<<< HEAD
<<<<<<< HEAD
size=2
stride=2

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
stride=2
size=2

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
<<<<<<< HEAD
<<<<<<< HEAD
size=2
stride=2

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
stride=2
size=2

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
<<<<<<< HEAD
<<<<<<< HEAD
size=2
stride=2

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
stride=2
size=2

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
<<<<<<< HEAD
<<<<<<< HEAD
size=2
stride=2
padding=1

[convolutional]
batch_normalize=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
stride=2
size=2

[convolutional]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
filters=1024
size=3
stride=1
pad=1
activation=leaky

<<<<<<< HEAD
<<<<<<< HEAD
[convolutional]
filters=1000
size=1
stride=1
pad=1
activation=leaky

[avgpool]

[softmax]
groups=1
=======
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592
[avgpool]

[dropout]
probability=.5

[connected]
output=1000
activation=leaky

[softmax]
<<<<<<< HEAD
>>>>>>> b5b3d7367411302dd6e73c8fe583d6860a786445
=======
>>>>>>> 07267f401b3d9c82c5f695f932c9f504d2b6a592

[cost]
type=sse

